---
kind: property
id: P:Autodesk.Revit.DB.Visual.PlasticVinyl.PlasticvinylColorByObject
source: html/b1fdd314-2f1b-d249-36f4-032acb4cced6.htm
---
# Autodesk.Revit.DB.Visual.PlasticVinyl.PlasticvinylColorByObject Property

The property labeled "Color By Object" from the "PlasticVinyl" schema.

## Syntax (C#)
```csharp
public static string PlasticvinylColorByObject { get; }
```

## Remarks
This property is of type "AssetPropertyBoolean".